### Libraries

In [23]:
import pandas as pd
import requests
import re
from bs4 import BeautifulSoup
import warnings 
warnings.filterwarnings('ignore')
import matplotlib.pyplot as plt
import numpy as np
import seaborn as sns

In [2]:
url = "https://www.ambitionbox.com/companies-in-hyderabad"

In [3]:
res = requests.get(url)
res.status_code

403

In [2]:
req_headers = {"content-type":"image/svg+xml","accept-encoding":"gzip, deflate, br, zstd",
              "user-agent":"Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/143.0.0.0 Safari/537.36"}

In [5]:
res = requests.get(url,headers=req_headers)

In [6]:
res.status_code

200

In [7]:
# "companyCardWrapper" ----> Main div
# "companyCardWrapper__primaryInformation" -----> 1st div
# "companyCardWrapper__tertiaryInformation" ----> 2nd div

In [22]:
# 1st div
# "companyCardWrapper__companyName" , "h2"  ----> Company Name
# "rating_star_container" , "div" ,"div" ,"rating_text rating_text--md "  -----> rating
# "companyCardWrapper__companyRatingCount" , "span" -----> total reviews
# "companyCardWrapper__interLinking" , "span"    --------> category and Place
# "companyCardWrapper__ratingValues" , "span" ------> Highly_rated score
# "companyCardWrapper__ratingValues" , "span" ------> low_rated score

# 2nd div
# "companyCardWrapper__ActionCount" , "span" ----> salary
# "companyCardWrapper__ActionCount" , "span" ----> interviews
# "companyCardWrapper__ActionCount" , "span" ----> jobs count
# "companyCardWrapper__ActionCount" , "span" ----> benefits count

### Data Scientists

In [56]:
company_name=[]
cat_place = []
reviews = []
ratings = []
salaries = []
interviews = []
jobs = []
benefits = []

for i in range(1,8):
    
    url=f"https://www.ambitionbox.com/list-of-companies?designation=data-scientist&sortBy=topPaying&page={i}"
    page = requests.get(url,headers= req_headers)
    soup=BeautifulSoup(page.text,"html.parser")

    for card in soup.find_all("div", class_="companyCardWrapper"):

        primary = card.find("div", class_="companyCardWrapper__primaryInformation")
        secondary = card.find("div", class_="companyCardWrapper__tertiaryInformation")
    
        # ---- Primary div ----
        pname = primary.find("h2", class_="companyCardWrapper__companyName")
        company_name.append(pname.get_text(strip=True) if pname else np.nan)
    
        dplace = primary.find("span", class_="companyCardWrapper__interLinking")
        cat_place.append(dplace.get_text(strip=True) if dplace else np.nan)
    
        pl = primary.find("span", class_="companyCardWrapper__companyRatingCount")
        reviews.append(pl.get_text(strip=True) if pl else np.nan)
    
        rate = primary.find("div", class_="rating_text rating_text--md")
        ratings.append(rate.get_text(strip=True) if rate else np.nan)
    
        # ---- Secondary div -----
    
        counts = secondary.find_all("span", class_="companyCardWrapper__ActionCount")
        salaries.append(counts[1].get_text(strip=True) if len(counts) > 1 else np.nan)
        interviews.append(counts[2].get_text(strip=True) if len(counts) > 2 else np.nan)
        jobs.append(counts[3].get_text(strip=True) if len(counts) > 3 else np.nan)
        benefits.append(counts[4].get_text(strip=True) if len(counts) > 4 else np.nan)

In [59]:
len(company_name)

140

In [60]:
df_ds = pd.DataFrame({
    "company": company_name,
    "category_location": cat_place,
    "rating": ratings,
    "reviews": reviews,
    "salaries": salaries,
    "interviews": interviews,
    "jobs": jobs,
    "benefits": benefits
})

df_ds["designation"] = "Data Scientist"

In [61]:
df_ds.head()

,company,category_location,rating,reviews,salaries,interviews,jobs,benefits,designation
0,Atlassian,Software Product | Bangalore / Bengaluru +6 ot...,3.1,(163),3.8k,95,63,4,Data Scientist
1,ABCD,Education & Training | Bangalore / Bengaluru +...,4.0,(226),4.9k,96,--,12,Data Scientist
2,Facebook,Internet | Bangalore / Bengaluru +27 other loc...,4.4,(168),1.2k,55,--,22,Data Scientist
3,Coursera,EdTech | Gurgaon / Gurugram +5 other locations,3.4,(42),371,10,15,1,Data Scientist
4,UBS,Financial Services | Pune +19 other locations,3.8,(3.4k),31.3k,369,1,117,Data Scientist

In [62]:
df_ds.shape

(140, 9)

In [63]:
df_ds.isnull().sum()

company              0
category_location    0
rating               0
reviews              0
salaries             0
interviews           0
jobs                 0
benefits             0
designation          0
dtype: int64

In [64]:
df_ds.duplicated().sum()

np.int64(0)

In [65]:
df_ds.to_csv("ambitionbox_DS.csv",index=False)

In [66]:
df = pd.read_csv("ambitionbox_DS.csv")
df.head()

,company,category_location,rating,reviews,salaries,interviews,jobs,benefits,designation
0,Atlassian,Software Product | Bangalore / Bengaluru +6 ot...,3.1,(163),3.8k,95,63,4,Data Scientist
1,ABCD,Education & Training | Bangalore / Bengaluru +...,4.0,(226),4.9k,96,--,12,Data Scientist
2,Facebook,Internet | Bangalore / Bengaluru +27 other loc...,4.4,(168),1.2k,55,--,22,Data Scientist
3,Coursera,EdTech | Gurgaon / Gurugram +5 other locations,3.4,(42),371,10,15,1,Data Scientist
4,UBS,Financial Services | Pune +19 other locations,3.8,(3.4k),31.3k,369,1,117,Data Scientist

### Data Analyst

In [3]:
company_name=[]
cat_place = []
reviews = []
ratings = []
salaries = []
interviews = []
jobs = []
benefits = []

for i in range(1,8):
    
    url=f"https://www.ambitionbox.com/list-of-companies?designation=data-analyst&sortBy=topPaying&experience=0&page={i}"
    req_headers = {"content-type":"image/svg+xml","accept-encoding":"gzip, deflate, br, zstd",
              "user-agent":"Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/143.0.0.0 Safari/537.36"}
    page = requests.get(url,headers= req_headers)
    soup=BeautifulSoup(page.text,"html.parser")

    for card in soup.find_all("div", class_="companyCardWrapper"):

        primary = card.find("div", class_="companyCardWrapper__primaryInformation")
        secondary = card.find("div", class_="companyCardWrapper__tertiaryInformation")
    
        # ---- Primary div ----
        pname = primary.find("h2", class_="companyCardWrapper__companyName")
        company_name.append(pname.get_text(strip=True) if pname else np.nan)
    
        dplace = primary.find("span", class_="companyCardWrapper__interLinking")
        cat_place.append(dplace.get_text(strip=True) if dplace else np.nan)
    
        pl = primary.find("span", class_="companyCardWrapper__companyRatingCount")
        reviews.append(pl.get_text(strip=True) if pl else np.nan)
    
        rate = primary.find("div", class_="rating_text rating_text--md")
        ratings.append(rate.get_text(strip=True) if rate else np.nan)

            
        # ---- Secondary div -----
    
        counts = secondary.find_all("span", class_="companyCardWrapper__ActionCount")
        salaries.append(counts[1].get_text(strip=True) if len(counts) > 1 else np.nan)
        interviews.append(counts[2].get_text(strip=True) if len(counts) > 2 else np.nan)
        jobs.append(counts[3].get_text(strip=True) if len(counts) > 3 else np.nan)
        benefits.append(counts[4].get_text(strip=True) if len(counts) > 4 else np.nan)

In [6]:
df_da = pd.DataFrame({
    "company": company_name,
    "category_location": cat_place,
    "rating": ratings,
    "reviews": reviews,
    "salaries": salaries,
    "interviews": interviews,
    "jobs": jobs,
    "benefits": benefits
})

df_da["designation"] = "Data Analyst"

In [8]:
df_da.isnull().sum()

company              0
category_location    0
rating               0
reviews              0
salaries             0
interviews           0
jobs                 0
benefits             0
designation          0
dtype: int64

In [9]:
df_da.duplicated().sum()

np.int64(1)

In [10]:
df_da.drop_duplicates(inplace=True)

In [11]:
df_da.shape

(139, 9)

In [12]:
df_da.to_csv("ambitionbox_DA.csv",index=False)

In [ ]:
# Data Engineer Role

In [16]:
company_name=[]
cat_place = []
reviews = []
ratings = []
salaries = []
interviews = []
jobs = []
benefits = []

for i in range(1,8):
    
    url=f"https://www.ambitionbox.com/list-of-companies?designation=data-engineer&sortBy=topPaying&page={i}"
    req_headers = {"content-type":"image/svg+xml","accept-encoding":"gzip, deflate, br, zstd",
              "user-agent":"Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/143.0.0.0 Safari/537.36"}
    page = requests.get(url,headers= req_headers)
    soup=BeautifulSoup(page.text,"html.parser")

    for card in soup.find_all("div", class_="companyCardWrapper"):

        primary = card.find("div", class_="companyCardWrapper__primaryInformation")
        secondary = card.find("div", class_="companyCardWrapper__tertiaryInformation")
    
        # ---- Primary div ----
        pname = primary.find("h2", class_="companyCardWrapper__companyName")
        company_name.append(pname.get_text(strip=True) if pname else np.nan)
    
        dplace = primary.find("span", class_="companyCardWrapper__interLinking")
        cat_place.append(dplace.get_text(strip=True) if dplace else np.nan)

        pl = primary.find("span", class_="companyCardWrapper__companyRatingCount")
        reviews.append(pl.get_text(strip=True) if pl else np.nan)
    
        rate = primary.find("div", class_="rating_text rating_text--md")
        ratings.append(rate.get_text(strip=True) if rate else np.nan)

            
        # ---- Secondary div -----
    
        counts = secondary.find_all("span", class_="companyCardWrapper__ActionCount")
        salaries.append(counts[1].get_text(strip=True) if len(counts) > 1 else np.nan)
        interviews.append(counts[2].get_text(strip=True) if len(counts) > 2 else np.nan)
        jobs.append(counts[3].get_text(strip=True) if len(counts) > 3 else np.nan)
        benefits.append(counts[4].get_text(strip=True) if len(counts) > 4 else np.nan)

In [18]:
df_de = pd.DataFrame({
    "company": company_name,
    "category_location": cat_place,
    "rating": ratings,
    "reviews": reviews,
    "salaries": salaries,
    "interviews": interviews,
    "jobs": jobs,
    "benefits": benefits
})

df_de["designation"] = "Data Engineer"

In [19]:
df_de.head()

,company,category_location,rating,reviews,salaries,interviews,jobs,benefits,designation
0,Salesforce,Software Product | Hyderabad / Secunderabad +4...,3.9,(1.1k),12.5k,243,153,104,Data Engineer
1,Google,Software Product | Bangalore / Bengaluru +84 o...,4.4,(1.9k),30.8k,993,594,132,Data Engineer
2,Atlassian,Software Product | Bangalore / Bengaluru +6 ot...,3.1,(163),3.8k,95,63,4,Data Engineer
3,Apple,Consumer Electronics & Appliances | Bangalore ...,4.3,(680),5k,162,284,51,Data Engineer
4,Snowflake,Software Product | Pune +3 other locations,3.5,(35),418,12,--,1,Data Engineer

In [20]:
df_de.shape

(140, 9)

In [21]:
df_de.isnull().sum()

company              0
category_location    0
rating               0
reviews              0
salaries             0
interviews           0
jobs                 0
benefits             0
designation          0
dtype: int64

In [22]:
df_de.duplicated().sum()

np.int64(0)

In [23]:
df_de.to_csv("ambitionbox_DE.csv",index=False)

In [24]:
# We had 3 Datasets 
# 1. Data Science
# 2. Data Analyst
# 3. Data Engineer

# we are now concatenating all three to 1 single dataset

In [26]:
ds = pd.read_csv("ambitionbox_DS.csv")
ds.head()

,company,category_location,rating,reviews,salaries,interviews,jobs,benefits,designation
0,Atlassian,Software Product | Bangalore / Bengaluru +6 ot...,3.1,(163),3.8k,95,63,4,Data Scientist
1,ABCD,Education & Training | Bangalore / Bengaluru +...,4.0,(226),4.9k,96,--,12,Data Scientist
2,Facebook,Internet | Bangalore / Bengaluru +27 other loc...,4.4,(168),1.2k,55,--,22,Data Scientist
3,Coursera,EdTech | Gurgaon / Gurugram +5 other locations,3.4,(42),371,10,15,1,Data Scientist
4,UBS,Financial Services | Pune +19 other locations,3.8,(3.4k),31.3k,369,1,117,Data Scientist

In [27]:
ds.shape

(140, 9)

In [28]:
da = pd.read_csv("ambitionbox_DA.csv")
da.head()

,company,category_location,rating,reviews,salaries,interviews,jobs,benefits,designation
0,ABB,Industrial Machinery | Bangalore / Bengaluru +...,4.1,(3.3k),17.7k,283,203,346,Data Analyst
1,Goldman Sachs,Financial Services | Bangalore / Bengaluru +22...,3.4,(1.5k),19.2k,406,229,100,Data Analyst
2,GroundTruth,Marketing & Advertising | Gurgaon / Gurugram,3.3,(70),390,4,22,12,Data Analyst
3,PayPal,FinTech | Bangalore / Bengaluru +15 other loca...,3.8,(1.1k),9.3k,234,--,120,Data Analyst
4,Citicorp,Financial Services | Pune +68 other locations,3.7,(5.4k),51.8k,616,--,517,Data Analyst

In [29]:
da.shape

(139, 9)

In [30]:
de = pd.read_csv("ambitionbox_DE.csv")
de.head()

,company,category_location,rating,reviews,salaries,interviews,jobs,benefits,designation
0,Salesforce,Software Product | Hyderabad / Secunderabad +4...,3.9,(1.1k),12.5k,243,153,104,Data Engineer
1,Google,Software Product | Bangalore / Bengaluru +84 o...,4.4,(1.9k),30.8k,993,594,132,Data Engineer
2,Atlassian,Software Product | Bangalore / Bengaluru +6 ot...,3.1,(163),3.8k,95,63,4,Data Engineer
3,Apple,Consumer Electronics & Appliances | Bangalore ...,4.3,(680),5k,162,284,51,Data Engineer
4,Snowflake,Software Product | Pune +3 other locations,3.5,(35),418,12,--,1,Data Engineer

In [31]:
de.shape

(140, 9)

In [32]:
df = pd.concat([ds, da, de], ignore_index=True)

In [33]:
df.head()

,company,category_location,rating,reviews,salaries,interviews,jobs,benefits,designation
0,Atlassian,Software Product | Bangalore / Bengaluru +6 ot...,3.1,(163),3.8k,95,63,4,Data Scientist
1,ABCD,Education & Training | Bangalore / Bengaluru +...,4.0,(226),4.9k,96,--,12,Data Scientist
2,Facebook,Internet | Bangalore / Bengaluru +27 other loc...,4.4,(168),1.2k,55,--,22,Data Scientist
3,Coursera,EdTech | Gurgaon / Gurugram +5 other locations,3.4,(42),371,10,15,1,Data Scientist
4,UBS,Financial Services | Pune +19 other locations,3.8,(3.4k),31.3k,369,1,117,Data Scientist

In [34]:
df.tail()

,company,category_location,rating,reviews,salaries,interviews,jobs,benefits,designation
414,Stonex,Internet | New Delhi +26 other locations,3.9,(167),1k,29,11,16,Data Engineer
415,EXL Service,Analytics & KPO | Noida +63 other locations,3.6,(8.4k),43.7k,883,1.4k,799,Data Engineer
416,KPMG Global Services,Management Consulting | Bangalore / Bengaluru ...,3.5,(2.6k),23.4k,250,9,6,Data Engineer
417,Clarivate,Analytics & KPO | Bangalore / Bengaluru +17 ot...,3.7,(796),6.3k,92,82,47,Data Engineer
418,NTT Data,IT Services & Consulting | Bangalore / Bengalu...,3.8,(5k),35.6k,728,126,156,Data Engineer

In [36]:
df.shape

(419, 9)

In [37]:
df.isnull().sum()

company              0
category_location    0
rating               0
reviews              0
salaries             0
interviews           0
jobs                 0
benefits             0
designation          0
dtype: int64

In [38]:
df.duplicated().sum()

np.int64(0)

In [39]:
# converting to a csv file
df.to_csv("ambitionbox_dataset.csv",index=False)

In [40]:
df = pd.read_csv("ambitionbox_dataset.csv")
df.head()

,company,category_location,rating,reviews,salaries,interviews,jobs,benefits,designation
0,Atlassian,Software Product | Bangalore / Bengaluru +6 ot...,3.1,(163),3.8k,95,63,4,Data Scientist
1,ABCD,Education & Training | Bangalore / Bengaluru +...,4.0,(226),4.9k,96,--,12,Data Scientist
2,Facebook,Internet | Bangalore / Bengaluru +27 other loc...,4.4,(168),1.2k,55,--,22,Data Scientist
3,Coursera,EdTech | Gurgaon / Gurugram +5 other locations,3.4,(42),371,10,15,1,Data Scientist
4,UBS,Financial Services | Pune +19 other locations,3.8,(3.4k),31.3k,369,1,117,Data Scientist

In [43]:
# Cleaning the data to perform EDA

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 419 entries, 0 to 418
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   company            419 non-null    object
 1   category_location  419 non-null    object
 2   rating             419 non-null    float64
 3   reviews            419 non-null    object
 4   salaries           419 non-null    object
 5   interviews         419 non-null    object
 6   jobs               419 non-null    object
 7   benefits           419 non-null    object
 8   designation        419 non-null    object
dtypes: float64(1), object(8)
memory usage: 29.6+ KB

In [47]:
df["jobs"].unique()

array(['63', '--', '15', '1', '4', '50', '9', '13', '10', '49', '142',
       '94', '48', '153', '25', '6', '16', '104', '164', '146', '24',
       '386', '294', '600', '36', '2', '8', '174', '60', '83', '295',
       '1.4k', '32', '7', '30', '110', '657', '321', '14', '138', '47',
       '80', '18', '198', '383', '12', '17', '170', '68', '37', '325',
       '284', '53', '19', '21', '1.1k', '3', '70', '188', '147', '59',
       '263', '62', '42', '91', '11', '86', '247', '252', '152', '229',
       '69', '20', '154', '143', '28', '55', '133', '35', '676', '52',
       '5', '131', '51', '203', '22', '136', '353', '27', '594', '113',
       '207', '39', '38', '26', '29', '231', '125', '43', '56', '44',
       '40', '330', '79', '201', '190', '95', '23', '73', '76', '193',
       '82', '557', '33', '45', '105', '78', '679', '1.5k', '140', '107',
       '99', '116', '77', '151', '179', '108', '223', '254', '172', '981',
       '88', '58', '161', '126'], dtype=object)

In [48]:
df["salaries"].unique()

array(['3.8k', '4.9k', '1.2k', '371', '31.3k', '7.4k', '4k', '8k', '3.5k',
       '2.5k', '3.3k', '1.7k', '6.2k', '22k', '9.2k', '1.5k', '9.3k',
       '12.5k', '3.1k', '5.2k', '8.3k', '6.5k', '54.1k', '18.7k', '28.6k',
       '38.2k', '4.4k', '12.7k', '15.2k', '10.9k', '30.8k', '6.3k',
       '13.7k', '3.7k', '27.2k', '48.4k', '13.2k', '1.5L', '7.8k',
       '49.3k', '202', '8.8k', '51.8k', '49k', '14.5k', '84.5k', '7.3k',
       '7.6k', '5.8k', '12.2k', '10.3k', '28.1k', '55.1k', '25.3k',
       '5.3k', '17.2k', '11.1k', '32.9k', '403', '9.9k', '329', '16k',
       '388', '35.9k', '5k', '16.2k', '1k', '227', '62.2k', '18.9k',
       '62.1k', '12.8k', '6.8k', '7.1k', '14.6k', '30.9k', '20.7k',
       '15.1k', '9.7k', '25.6k', '838', '42.5k', '21.1k', '12.6k', '7.7k',
       '605', '9k', '11.3k', '316', '249', '348', '24.5k', '20.1k', '813',
       '1.4k', '33.6k', '48.5k', '19.2k', '10.8k', '9.1k', '10.2k',
       '26.3k', '4.5k', '1.1k', '40.5k', '22.7k', '983', '41.9k', '11.4k',
       '2.1L', '9.8k', '50.4k', '432', '552', '8.7k', '15.4k', '924',
       '10.5k', '17.7k', '390', '7.2k', '4.3k', '2.3k', '2.9k', '910',
       '2.2k', '15.5k', '203', '596', '1L', '4.2k', '6.4k', '8.9k', '598',
       '112', '2.8k', '8.5k', '299', '315', '11.8k', '3.6k', '1.9k',
       '6.1k', '2k', '43.7k', '458', '14.4k', '1.6k', '1.8k', '270',
       '3.9k', '8.6k', '5.4k', '17.3k', '30.6k', '10.4k', '230', '2.6k',
       '2.4k', '6.7k', '18.3k', '103', '24.2k', '1.3k', '2.7k', '12k',
       '23.4k', '2.5L', '64.5k', '39.9k', '24.1k', '4.7k', '662', '17.6k',
       '245', '70', '4.8k', '72.8k', '473', '474', '22.5k', '37.4k',
       '418', '466', '379', '30.7k', '12.1k', '205', '4.1k', '5.7k',
       '24k', '5.1k', '5.9k', '4.6k', '56', '3.4k', '649', '3.2k', '5.5k',
       '9.6k', '66', '621', '98', '2.1k', '35.6k'], dtype=object)

In [49]:
df["benefits"].unique()

array(['4', '12', '22', '1', '117', '48', '70', '160', '40', '43', '27',
       '13', '39', '319', '297', '6', '102', '120', '104', '8', '45',
       '47', '63', '86', '1.4k', '223', '196', '20', '46', '183', '57',
       '417', '299', '132', '23', '257', '546', '686', '114', '244',
       '4.1k', '141', '692', '--', '91', '517', '1.6k', '218', '140',
       '844', '7', '245', '186', '150', '305', '413', '855', '112', '284',
       '100', '9', '3', '226', '59', '266', '399', '51', '44', '62',
       '537', '617', '420', '2.5k', '144', '192', '67', '151', '432',
       '253', '362', '397', '125', '998', '445', '75', '2', '227', '435',
       '212', '391', '632', '146', '180', '129', '76', '55', '656', '89',
       '520', '515', '293', '16', '200', '2.6k', '2k', '37', '189', '28',
       '273', '410', '10', '346', '3.7k', '87', '148', '30', '121', '458',
       '61', '2.1k', '153', '83', '82', '119', '361', '49', '799', '389',
       '14', '58', '31', '53', '197', '101', '21', '524', '134', '243',
       '221', '26', '136', '638', '29', '237', '2.4k', '749', '625',
       '539', '80', '5', '311', '107', '25', '116', '1.8k', '77', '530',
       '308', '17', '173', '614', '24', '527', '163', '60', '64', '205',
       '15', '35', '122', '224', '260', '203', '73', '261', '18', '110',
       '156'], dtype=object)

In [50]:
df["reviews"].unique()

array(['(163)', '(226)', '(168)', '(42)', '(3.4k)', '(854)', '(779)',
       '(1.2k)', '(390)', '(608)', '(364)', '(218)', '(463)', '(3.1k)',
       '(2.1k)', '(296)', '(1k)', '(1.1k)', '(117)', '(408)', '(495)',
       '(705)', '(871)', '(12.6k)', '(7.4k)', '(623)', '(521)', '(4k)',
       '(2.3k)', '(1.9k)', '(684)', '(2.7k)', '(602)', '(4.5k)', '(7.7k)',
       '(902)', '(30.6k)', '(956)', '(13.9k)', '(3)', '(5.4k)', '(16.8k)',
       '(2.8k)', '(7.5k)', '(1.8k)', '(1.6k)', '(1.3k)', '(2.2k)',
       '(3.8k)', '(8.2k)', '(484)', '(418)', '(891)', '(935)', '(1.7k)',
       '(39)', '(2k)', '(282)', '(74)', '(4.3k)', '(680)', '(687)',
       '(564)', '(171)', '(31)', '(6.2k)', '(3.7k)', '(31.9k)', '(1.4k)',
       '(2.5k)', '(663)', '(987)', '(3.2k)', '(951)', '(82)', '(8.3k)',
       '(6k)', '(58)', '(43)', '(51)', '(88)', '(271)', '(5.6k)',
       '(1.5k)', '(644)', '(7.6k)', '(897)', '(556)', '(141)', '(986)',
       '(3k)', '(145)', '(425)', '(25.2k)', '(213)', '(17.5k)', '(383)',
       '(53)', '(817)', '(6.5k)', '(64)', '(3.3k)', '(70)', '(45k)',
       '(840)', '(487)', '(745)', '(467)', '(565)', '(774)', '(290)',
       '(101)', '(300)', '(3.9k)', '(488)', '(224)', '(277)', '(604)',
       '(32.2k)', '(430)', '(2.6k)', '(109)', '(295)', '(20)', '(422)',
       '(165)', '(34)', '(674)', '(3.6k)', '(833)', '(242)', '(678)',
       '(635)', '(8.4k)', '(222)', '(121)', '(365)', '(413)', '(709)',
       '(932)', '(671)', '(417)', '(5.1k)', '(21)', '(386)', '(532)',
       '(291)', '(502)', '(842)', '(7k)', '(334)', '(370)', '(227)',
       '(22.3k)', '(462)', '(5.5k)', '(952)', '(395)', '(646)', '(178)',
       '(274)', '(38)', '(135)', '(66)', '(6)', '(796)', '(700)',
       '(19.7k)', '(973)', '(61)', '(2.9k)', '(280)', '(208)', '(4.7k)',
       '(35)', '(164)', '(230)', '(32)', '(62)', '(140)', '(936)',
       '(231)', '(503)', '(722)', '(138)', '(14)', '(483)', '(486)',
       '(318)', '(559)', '(686)', '(434)', '(650)', '(610)', '(340)',
       '(575)', '(283)', '(429)', '(359)', '(573)', '(56)', '(454)',
       '(941)', '(788)', '(4)', '(281)', '(624)', '(599)', '(603)',
       '(326)', '(2)', '(293)', '(83)', '(333)', '(875)', '(330)', '(8)',
       '(177)', '(270)', '(557)', '(192)', '(167)', '(5k)'], dtype=object)

In [52]:
df["interviews"].unique()

array(['95', '96', '55', '10', '369', '109', '32', '121', '42', '86',
       '85', '25', '156', '434', '418', '35', '166', '234', '243', '31',
       '22', '246', '135', '1.6k', '402', '604', '867', '80', '264',
       '373', '993', '228', '81', '266', '746', '216', '233', '5.7k',
       '97', '891', '9', '236', '616', '1.1k', '359', '148', '848', '--',
       '205', '113', '260', '280', '284', '673', '213', '239', '153',
       '312', '162', '584', '8', '165', '5', '210', '13', '415', '66',
       '311', '28', '140', '6', '941', '244', '3.6k', '110', '190', '68',
       '84', '306', '173', '149', '329', '24', '468', '288', '99', '18',
       '187', '7', '325', '11', '107', '684', '497', '874', '406', '517',
       '176', '145', '141', '101', '595', '76', '613', '21', '676', '222',
       '292', '33', '317', '44', '127', '2.6k', '53', '200', '663', '20',
       '146', '12', '52', '680', '134', '283', '4', '2.9k', '102', '133',
       '37', '56', '39', '276', '91', '159', '1.9k', '116', '40', '432',
       '48', '29', '126', '208', '51', '177', '98', '168', '59', '883',
       '252', '50', '23', '88', '198', '16', '300', '538', '203', '73',
       '60', '248', '201', '231', '75', '674', '57', '111', '191', '250',
       '3.2k', '61', '909', '382', '474', '184', '89', '193', '63', '132',
       '256', '2', '92', '138', '1.5k', '77', '14', '291', '19', '575',
       '142', '560', '83', '3', '390', '261', '143', '65', '93', '154',
       '112', '27', '67', '150', '105', '124', '289', '49', '90', '119',
       '46', '281', '82', '45', '30', '115', '728'], dtype=object)

In [53]:
df.columns

Index(['company', 'category_location', 'rating', 'reviews', 'salaries',
       'interviews', 'jobs', 'benefits', 'designation'],
      dtype='object')

In [62]:
df["category_location"].apply(lambda x: re.split(r"|",x))

0      [, S, o, f, t, w, a, r, e,  , P, r, o, d, u, c...
1      [, E, d, u, c, a, t, i, o, n,  , &,  , T, r, a...
2      [, I, n, t, e, r, n, e, t,  , |,  , B, a, n, g...
3      [, E, d, T, e, c, h,  , |,  , G, u, r, g, a, o...
4      [, F, i, n, a, n, c, i, a, l,  , S, e, r, v, i...
                             ...
414    [, I, n, t, e, r, n, e, t,  , |,  , N, e, w,  ...
415    [, A, n, a, l, y, t, i, c, s,  , &,  , K, P, O...
416    [, M, a, n, a, g, e, m, e, n, t,  , C, o, n, s...
417    [, A, n, a, l, y, t, i, c, s,  , &,  , K, P, O...
418    [, I, T,  , S, e, r, v, i, c, e, s,  , &,  , C...
Name: category_location, Length: 419, dtype: object

In [66]:
df["type"] =  df["category_location"].astype(str).str.split("|").str[0].str.strip()

In [68]:
df.type.unique()

array(['Software Product', 'Education & Training', 'Internet', 'EdTech',
       'Financial Services', 'IT Services & Consulting', 'Gaming',
       'FinTech', 'Retail', 'Pharma', 'Management Consulting',
       'Hardware & Networking', 'Oil & Gas', 'Industrial Machinery',
       'Food Processing', 'Banking', 'Bangalore / Bengaluru',
       'Semiconductors', 'Telecom', 'Marketing & Advertising',
       'Healthcare', 'Recruitment',
       'Bangalore / Bengaluru +107 other locations', 'Analytics & KPO',
       'Consumer Electronics & Appliances', 'Logistics', 'Beverage',
       'Automobile', 'NBFC', 'BPO', 'Insurance',
       'Gurgaon / Gurugram +4 other locations',
       'Chandigarh +8 other locations', 'Industrial Automation',
       'Medical Equipment', 'Defence & Aerospace',
       'Electronics Manufacturing',
       'Investment Banking / Venture Capital / Private Equity',
       'Chemicals', 'New Delhi +16 other locations',
       'Mumbai +3 other locations', 'Beauty & Personal Care', 'Other',
       'Clinical Research', 'Bangalore / Bengaluru +2 other locations',
       'Building Material', 'Furniture & Furnishing',
       'New Delhi +1 other locations', 'FMCG', 'Real Estate',
       'Urban Transport', 'Fitness & Wellness',
       'Engineering & Construction',
       'Bangalore / Bengaluru +15 other locations', 'Auto Components',
       'Fashion & Textile', 'Aviation', 'Mumbai +2 other locations',
       'Biotechnology', 'Jaipur',
       'Bangalore / Bengaluru +12 other locations',
       'Mumbai +7 other locations', 'Kochi +2 other locations'],
      dtype=object)

In [73]:
location_mask = df["type"].str.contains(r"\+|/|locations|Bangalore|Mumbai|Delhi|Gurgaon|Chandigarh|Kochi|Jaipur",case=False,na=False)

In [74]:
df.loc[location_mask,"type"] = None

In [75]:
df.type.unique()

array(['Software Product', 'Education & Training', 'Internet', 'EdTech',
       'Financial Services', 'IT Services & Consulting', 'Gaming',
       'FinTech', 'Retail', 'Pharma', 'Management Consulting',
       'Hardware & Networking', 'Oil & Gas', 'Industrial Machinery',
       'Food Processing', 'Banking', None, 'Semiconductors', 'Telecom',
       'Marketing & Advertising', 'Healthcare', 'Recruitment',
       'Analytics & KPO', 'Consumer Electronics & Appliances',
       'Logistics', 'Beverage', 'Automobile', 'NBFC', 'BPO', 'Insurance',
       'Industrial Automation', 'Medical Equipment',
       'Defence & Aerospace', 'Electronics Manufacturing', 'Chemicals',
       'Beauty & Personal Care', 'Other', 'Clinical Research',
       'Building Material', 'Furniture & Furnishing', 'FMCG',
       'Real Estate', 'Urban Transport', 'Fitness & Wellness',
       'Engineering & Construction', 'Auto Components',
       'Fashion & Textile', 'Aviation', 'Biotechnology'], dtype=object)

In [76]:
df.type.isnull().sum()

np.int64(18)

In [77]:
# we now have 18 null values in type column 
# these are only location companies , this shows that they didnt specified there company type
# we are now leaving them and will looking into them later part of the EDA

In [96]:
# now extracting locations
df["location"] =  df["category_location"].astype(str).str.split("|").str[-1].str.extract(r"^([A-Za-z\s]+)")

In [99]:
df["location"] = df["location"].str.strip()

In [100]:
df["location"].unique()

array(['Bangalore', 'Gurgaon', 'Pune', 'Hyderabad', 'Noida', 'Mumbai',
       'Chennai', 'Chandigarh', 'New Delhi', 'Kolkata', 'Ahmedabad',
       'Jamnagar', 'Jaipur', 'Kochi'], dtype=object)

In [101]:
df["location"].isnull().sum()

np.int64(0)

In [102]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 419 entries, 0 to 418
Data columns (total 11 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   company            419 non-null    object
 1   category_location  419 non-null    object
 2   rating             419 non-null    float64
 3   reviews            419 non-null    object
 4   salaries           419 non-null    object
 5   interviews         419 non-null    object
 6   jobs               419 non-null    object
 7   benefits           419 non-null    object
 8   designation        419 non-null    object
 9   type               401 non-null    object
 10  location           419 non-null    object
dtypes: float64(1), object(10)
memory usage: 36.1+ KB

In [103]:
# benefits column
df["benefits"] = df["benefits"].apply(lambda x : re.sub(r"--","0",x))

In [104]:
df.benefits.unique()

array(['4', '12', '22', '1', '117', '48', '70', '160', '40', '43', '27',
       '13', '39', '319', '297', '6', '102', '120', '104', '8', '45',
       '47', '63', '86', '1.4k', '223', '196', '20', '46', '183', '57',
       '417', '299', '132', '23', '257', '546', '686', '114', '244',
       '4.1k', '141', '692', '0', '91', '517', '1.6k', '218', '140',
       '844', '7', '245', '186', '150', '305', '413', '855', '112', '284',
       '100', '9', '3', '226', '59', '266', '399', '51', '44', '62',
       '537', '617', '420', '2.5k', '144', '192', '67', '151', '432',
       '253', '362', '397', '125', '998', '445', '75', '2', '227', '435',
       '212', '391', '632', '146', '180', '129', '76', '55', '656', '89',
       '520', '515', '293', '16', '200', '2.6k', '2k', '37', '189', '28',
       '273', '410', '10', '346', '3.7k', '87', '148', '30', '121', '458',
       '61', '2.1k', '153', '83', '82', '119', '361', '49', '799', '389',
       '14', '58', '31', '53', '197', '101', '21', '524', '134', '243',
       '221', '26', '136', '638', '29', '237', '2.4k', '749', '625',
       '539', '80', '5', '311', '107', '25', '116', '1.8k', '77', '530',
       '308', '17', '173', '614', '24', '527', '163', '60', '64', '205',
       '15', '35', '122', '224', '260', '203', '73', '261', '18', '110',
       '156'], dtype=object)

In [106]:
df["new_benefits"] = (df["benefits"].astype(str).str.lower().str.replace("k","",regex=False).astype(float))

In [107]:
df.loc[df["benefits"].astype(str).str.contains("k",case=False,na=False),"new_benefits"]*=1000

In [109]:
df["new_benefits"]

0        4.0
1       12.0
2       22.0
3        1.0
4      117.0
       ...
414     16.0
415    799.0
416      6.0
417     47.0
418    156.0
Name: new_benefits, Length: 419, dtype: float64

In [112]:
# jobs column
df["jobs"] = df["jobs"].apply(lambda x : re.sub(r"--","0",x))

In [113]:
df["jobs_count"] = (df["jobs"].astype(str).str.lower().str.replace("k","",regex=False).astype(float))

In [114]:
df.loc[df["jobs"].astype(str).str.contains("k",case=False,na=False),"jobs_count"]*=1000

In [116]:
df.jobs_count

0        63.0
1         0.0
2         0.0
3        15.0
4         1.0
        ...
414      11.0
415    1400.0
416       9.0
417      82.0
418     126.0
Name: jobs_count, Length: 419, dtype: float64

In [117]:
# interviews column
df["interviews"] = df["interviews"].apply(lambda x : re.sub(r"--","0",x))

In [118]:
df["interviews_count"] = (df["interviews"].astype(str).str.lower().str.replace("k","",regex=False).astype(float))

In [119]:
df.loc[df["interviews"].astype(str).str.contains("k",case=False ,na=False),"interviews_count"]*=1000

In [121]:
df.interviews_count

0       95.0
1       96.0
2       55.0
3       10.0
4      369.0
       ...
414     29.0
415    883.0
416    250.0
417     92.0
418    728.0
Name: interviews_count, Length: 419, dtype: float64

In [128]:
# salaries column
df["salaries"] = df["salaries"].apply(lambda x:re.sub(r"--","",x))

In [133]:
df["salary"]  = (df["salaries"].astype(str).str.lower().str.replace("k","e3",regex=False).str.replace("l","e5",regex=False))

In [136]:
df["salary"] = pd.to_numeric(df["salary"],errors="coerce")

In [151]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 419 entries, 0 to 418
Data columns (total 17 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   company            419 non-null    object
 1   category_location  419 non-null    object
 2   rating             419 non-null    float64
 3   reviews            419 non-null    object
 4   salaries           419 non-null    object
 5   interviews         419 non-null    object
 6   jobs               419 non-null    object
 7   benefits           419 non-null    object
 8   designation        419 non-null    object
 9   type               401 non-null    object
 10  location           419 non-null    object
 11  new_benefits       419 non-null    float64
 12  jobs_count         419 non-null    float64
 13  interviews_count   419 non-null    float64
 14  salary             419 non-null    float64
 15  sal                419 non-null    float64
 16  reviews_count      419 non-null    int64
dtypes: float64(6), int64(1), object(10)
memory usage: 55.8+ KB

In [167]:
df.columns

Index(['company', 'category_location', 'rating', 'reviews', 'salaries',
       'interviews', 'jobs', 'benefits', 'designation', 'type', 'location',
       'new_benefits', 'jobs_count', 'interviews_count', 'salary', 'sal',
       'reviews_count', 'no_of_reviews'],
      dtype='object')

In [168]:
df.drop(columns=["reviews","reviews_count","no_of_reviews"],inplace=True)

In [170]:
reviews = pd.read_csv("ambitionbox_dataset.csv")

In [171]:
df = pd.concat([df.reset_index(drop=True),
                reviews[["reviews"]].reset_index(drop=True)],
               axis=1)

In [175]:
df.to_csv("ambitionbox_dataset_1.csv",index=False)

In [2]:
df = pd.read_csv("ambitionbox_dataset_1.csv")
df

,company,category_location,rating,salaries,interviews,jobs,benefits,designation,type,location,new_benefits,jobs_count,interviews_count,salary,sal,reviews
0,Atlassian,Software Product | Bangalore / Bengaluru +6 ot...,3.1,3.8k,95,63,4,Data Scientist,Software Product,Bangalore,4.0,63.0,95.0,3800.0,3.8,(163)
1,ABCD,Education & Training | Bangalore / Bengaluru +...,4.0,4.9k,96,0,12,Data Scientist,Education & Training,Bangalore,12.0,0.0,96.0,4900.0,4.9,(226)
2,Facebook,Internet | Bangalore / Bengaluru +27 other loc...,4.4,1.2k,55,0,22,Data Scientist,Internet,Bangalore,22.0,0.0,55.0,1200.0,1.2,(168)
3,Coursera,EdTech | Gurgaon / Gurugram +5 other locations,3.4,371,10,15,1,Data Scientist,EdTech,Gurgaon,1.0,15.0,10.0,371.0,371.0,(42)
4,UBS,Financial Services | Pune +19 other locations,3.8,31.3k,369,1,117,Data Scientist,Financial Services,Pune,117.0,1.0,369.0,31300.0,31.3,(3.4k)
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
414,Stonex,Internet | New Delhi +26 other locations,3.9,1k,29,11,16,Data Engineer,Internet,New Delhi,16.0,11.0,29.0,1000.0,1.0,(167)
415,EXL Service,Analytics & KPO | Noida +63 other locations,3.6,43.7k,883,1.4k,799,Data Engineer,Analytics & KPO,Noida,799.0,1400.0,883.0,43700.0,43.7,(8.4k)
416,KPMG Global Services,Management Consulting | Bangalore / Bengaluru ...,3.5,23.4k,250,9,6,Data Engineer,Management Consulting,Bangalore,6.0,9.0,250.0,23400.0,23.4,(2.6k)
417,Clarivate,Analytics & KPO | Bangalore / Bengaluru +17 ot...,3.7,6.3k,92,82,47,Data Engineer,Analytics & KPO,Bangalore,47.0,82.0,92.0,6300.0,6.3,(796)
418,NTT Data,IT Services & Consulting | Bangalore / Bengalu...,3.8,35.6k,728,126,156,Data Engineer,IT Services & Consulting,Bangalore,156.0,126.0,728.0,35600.0,35.6,(5k)

In [3]:
df["no_of_reviews"] = (df["reviews"].astype(str).str.lower().str.replace("k", "e3", regex=False).str.replace(r"[()]", "", regex=True))

In [4]:
df["no_of_reviews"] = df["no_of_reviews"].str.extract(r"^(\d+\.?\d*e\d+|\d+)$")

In [5]:
df["reviews_count"] = pd.to_numeric(df["no_of_reviews"],errors="coerce")

In [7]:
df.drop(columns=["category_location","sal","jobs","benefits","interviews","salaries","salaries","reviews","no_of_reviews"],inplace=True)

In [9]:
df.rename(columns={"company":"company_name","new_benefits":"benefits"},inplace=True)

In [10]:
df.head()

,company_name,rating,designation,type,location,benefits,jobs_count,interviews_count,salary,reviews_count
0,Atlassian,3.1,Data Scientist,Software Product,Bangalore,4.0,63.0,95.0,3800.0,163.0
1,ABCD,4.0,Data Scientist,Education & Training,Bangalore,12.0,0.0,96.0,4900.0,226.0
2,Facebook,4.4,Data Scientist,Internet,Bangalore,22.0,0.0,55.0,1200.0,168.0
3,Coursera,3.4,Data Scientist,EdTech,Gurgaon,1.0,15.0,10.0,371.0,42.0
4,UBS,3.8,Data Scientist,Financial Services,Pune,117.0,1.0,369.0,31300.0,3400.0

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 419 entries, 0 to 418
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   company_name      419 non-null    object
 1   rating            419 non-null    float64
 2   designation       419 non-null    object
 3   type              401 non-null    object
 4   location          419 non-null    object
 5   benefits          419 non-null    int64
 6   jobs_count        419 non-null    float64
 7   interviews_count  419 non-null    float64
 8   salary            419 non-null    float64
 9   reviews_count     419 non-null    float64
dtypes: float64(5), int64(1), object(4)
memory usage: 32.9+ KB

In [2]:
df.to_csv("ambitionbox_dataset_final.csv",index=False)

NameError: name 'df' is not defined